Revit 2027 API
ParameterTypeId.BendingDetailTypeAngularDimensionsForHooksEnabled Property
 "Hook Angles"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeAngularDimensionsForHooksEnabled { get; }
Public Shared ReadOnly Property BendingDetailTypeAngularDimensionsForHooksEnabled As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeAngularDimensionsForHooksEnabled {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeAngularDimensionsForHooksEnabled : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace